Repository: xingchenyang/DSHW
Catalog: DSHW.Desktop/Strings/*/Resources.resw
Source language: en_us
Languages: fr_fr, zh_cn

# StatusText.Text
source: Starting...
fr_fr: Démarrage...
zh_cn: 启动中...

# Status.Starting
source: Starting...
fr_fr: Démarrage...
zh_cn: 启动中...

# Status.Running
source: Running
fr_fr: En cours
zh_cn: 运行中

# Status.Stopped
source: Stopped
fr_fr: Arrêté
zh_cn: 已停止

# Status.Ready
source: Ready
fr_fr: Prêt
zh_cn: 就绪

# Status.Waiting
source: Waiting for DSH service...
fr_fr: En attente du service DSH...
zh_cn: 等待 DSH 服务...

# Status.LoadingUI
source: Loading Web UI...
fr_fr: Chargement de l'interface Web...
zh_cn: 加载 Web UI...

# Status.InitializingWebView
source: Initializing WebView2...
fr_fr: Initialisation de WebView2...
zh_cn: 初始化 WebView2...

# Status.NodeJsNotFound
source: Node.js not found
fr_fr: Node.js introuvable
zh_cn: 未找到 Node.js

# Status.WebViewError
source: WebView2 error
fr_fr: Erreur WebView2
zh_cn: WebView2 错误

# Tray.Show
source: Show Window
fr_fr: Afficher la fenêtre
zh_cn: 显示窗口

# Tray.Hide
source: Hide Window
fr_fr: Masquer la fenêtre
zh_cn: 隐藏窗口

# Tray.Exit
source: Exit
fr_fr: Quitter
zh_cn: 退出

# Tray.About
source: About DSHW
fr_fr: À propos de DSHW
zh_cn: 关于 DSHW

# About.Title
source: About DSHW
fr_fr: À propos de DSHW
zh_cn: 关于 DSHW

# About.Tagline
source: DSH Workbench for Windows
fr_fr: DSH Workbench pour Windows

# About.Description
source: A WinUI 3 + WebView2 desktop client for DSH.
fr_fr: Un client desktop WinUI 3 + WebView2 pour DSH.
zh_cn: 一个基于 WinUI 3 和 WebView2 的 DSH 桌面客户端。

# About.Copyright
source: Copyright © 2026 xingchenyang · MIT License
fr_fr: Copyright © 2026 xingchenyang · Licence MIT

# Dialog.Confirm
source: Confirm
fr_fr: Confirmer
zh_cn: 确认

# Dialog.AreYouSure
source: Are you sure?
fr_fr: Êtes-vous sûr ?
zh_cn: 您确定吗？

# Dialog.Error
source: Error
fr_fr: Erreur
zh_cn: 错误

# Dialog.Close
source: Close
fr_fr: Fermer
zh_cn: 关闭

# Install.Title
source: DSH not installed
fr_fr: DSH non installé
zh_cn: DSH 未安装

# Install.Header
source: DSH is not installed
fr_fr: DSH n'est pas installé
zh_cn: 检测到 DSH 未安装

# Install.Desc
source: Install @deepseek-ai/dsh to continue. Copy the command to run it yourself, or install right here.
fr_fr: Installez @deepseek-ai/dsh pour continuer. Copiez la commande pour l'exécuter vous-même, ou installez directement ici.
zh_cn: 需要先安装 @deepseek-ai/dsh 才能继续。可以复制命令自行安装，也可以直接在这里安装。

# Install.Copy
source: Copy command
fr_fr: Copier la commande
zh_cn: 复制命令

# Install.InstallNow
source: Install now
fr_fr: Installer maintenant
zh_cn: 立即安装

# Install.Recheck
source: Re-check
fr_fr: Revérifier
zh_cn: 重新检测

# Install.Succeeded
source: Install finished
fr_fr: Installation terminée
zh_cn: 安装完成

# Install.Failed
source: Install failed or cancelled
fr_fr: Échec de l'installation ou annulée
zh_cn: 安装失败或已取消

# Install.Checking
source: Checking DSH installation...
fr_fr: Vérification de l'installation de DSH...
zh_cn: 正在检测 DSH 安装...

# Install.Detected
source: detected
fr_fr: détecté
zh_cn: 已检测到

# Install.StillMissing
source: DSH still not detected
fr_fr: DSH toujours introuvable
zh_cn: 仍未检测到 DSH

# Install.BackupNote
source: ⚠ Before updating, your ~/.dsh folder is backed up automatically.
fr_fr: ⚠ Avant la mise à jour, votre dossier ~/.dsh est sauvegardé automatiquement.
zh_cn: ⚠ 更新前会自动备份 ~/.dsh 目录。

# Update.Title
source: DSH update available
fr_fr: Mise à jour DSH disponible
zh_cn: DSH 有可用更新

# Update.Copy
source: Copy command
fr_fr: Copier la commande
zh_cn: 复制命令

# Update.Copied
source: Copied ✓
fr_fr: Copié ✓
zh_cn: 已复制 ✓

# Update.RecheckNew
source: Checked — a new version {0} is available
fr_fr: Vérifié — une nouvelle version {0} est disponible
zh_cn: 已检查 — 有新版本 {0} 可用

# Update.RecheckSame
source: Checked — {0} is already the latest
fr_fr: Vérifié — {0} est déjà à jour
zh_cn: 已检查 — {0} 已是最新版本

# Update.RecheckFail
source: Re-check failed (offline?)
fr_fr: Vérification échouée (hors ligne ?)
zh_cn: 重新检测失败（离线？）

# Update.UpToDate
source: DSH {0} is up to date
fr_fr: DSH {0} est à jour
zh_cn: DSH {0} 已是最新版本

# Update.Recheck
source: Re-check
fr_fr: Revérifier
zh_cn: 重新检测

# Update.Verbose
source: Full logs (verbose)
fr_fr: Journaux complets (verbose)
zh_cn: 完整日志（verbose）

# Update.Mirror
source: Use mirror
fr_fr: Utiliser le miroir
zh_cn: 使用镜像

# Update.InstallNow
source: Install now (in-app)
fr_fr: Installer maintenant (app)
zh_cn: 立即安装（应用内）

# Update.BackupNote
source: ⚠ Updating may change your ~/.dsh config format. Your ~/.dsh is backed up automatically before install.
fr_fr: ⚠ La mise à jour peut modifier le format de ~/.dsh. Votre dossier ~/.dsh est sauvegardé automatiquement.
zh_cn: ⚠ 升级可能改变 ~/.dsh 配置格式。安装前会自动备份 ~/.dsh。

# Notification.DSHStarted
source: DSH started successfully
fr_fr: DSH démarré avec succès
zh_cn: DSH 启动成功

# Notification.DSHStopped
source: DSH stopped
fr_fr: DSH arrêté
zh_cn: DSH 已停止

# Notification.DSHCrashed
source: DSH crashed, restarting...
fr_fr: DSH planté, redémarrage...
zh_cn: DSH 崩溃，正在重启...

# Dialog.Information
source: Information
zh_cn: 信息
